/*Да се напише програма каде од тастатура ќе се внесе еден број кој има пет цифри,
но не мора да е петцифрен, како на пример 04569 или 00256.
Програмата ги печати сумите на паровите цифри од надвор кон внатре,
за на крај да ја испечати средишната цифра.
Така, ако внесениот број е 12596, програмата враќа 7 11 5.

  if (a/100000==0){
        printf("%d", a%10);
        if (a/10000==0);{
            printf("%d", (a/10)%10);}
            if (a/1000==0);{
                printf("%d", (a/100)%10);}
                 if (a/100==0);{
                    printf("%d", (a/1000)%10);}
                         if (a/10==0);{
                            printf("%d", (a/1000)%10);}
        else */

#include <stdio.h>

int main(){
    int a;
    scanf("%d", &a);
    int x1,x2,x3;
    x1=a%10+(a/10000);
    x2=(a/10)%10 + (a/1000)%10;
    x3=(a/100)%10;
    printf("%d %d %d", x1, x2, x3);
    return 0;
}
